app/views/welcome/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
            <br>
            <li>Auteur : <%= link_to "#{g.user.first_name}", user_path(g.user.id) %></li>