app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @my_gossip = Gossip.all.find(params[:id])

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("id", "title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 11], ["title", "Ça marche?"], ["content", "OUIIIIIIII !!!!"], ["user_id", 10], ["created_at", "2019-10-30 17:44:40.429610"], ["updated_at", "2019-10-30 17:44:40.429610"]]
---
  def create
    new_gossip = Gossip.new
    new_gossip.id = Gossip.all.length + 1
    new_gossip.title = params[:gossip_title]
    new_gossip.content = params[:gossip_content]
    new_gossip.user = current_user
    if new_gossip.save