app/controllers/users_controller.rb

  def create
    if params[:new_password] == params[:new_password_confirmation]
      u = User.new
      u.id = User.all.length + 1
      u.email = params[:new_email]
      u.password = params[:new_password]
      u.first_name = params[:new_first_name]
      u.last_name = params[:new_last_name]
      u.age = params[:new_age]
      u.description = params[:new_description]
      if City.all.find_by(name: params[:new_city])
        u.city_id = params[:new_city].id
      else
        c = City.new
        c.name = params[:new_city]
        c.zip_code = "#{rand(0..9)}#{rand(1..5)}#{Faker::Number.unique.between(from: 10, to: 88)}0"
        c.id = City.all.length + 1
        c.save
        u.city_id = c.id
      end
      if u.save
---
SELECT "users".* FROM "users"
SELECT  "cities".* FROM "cities" WHERE "cities"."name" = $1 LIMIT $2  [["name", "MONTPELLIER"], ["LIMIT", 1]]
SELECT "cities".* FROM "cities"
INSERT INTO "cities" ("id", "name", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 11], ["name", "MONTPELLIER"], ["zip_code", "02300"], ["created_at", "2019-10-31 13:57:40.394097"], ["updated_at", "2019-10-31 13:57:40.394097"]]
INSERT INTO "users" ("id", "first_name", "last_name", "email", "age", "description", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @my_user = User.all.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]